---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelTopZProjection
source: html/0d6b4831-5d53-5eda-40d3-c768564cdb5c.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelTopZProjection Property

"Top z Projection"

## Syntax (C#)
```csharp
public static ForgeTypeId AnalyticalModelTopZProjection { get; }
```